cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'node'
brew 'yarn'
brew 'wget'
brew 'cocoapods'
brew 'carthage' 
brew 'zsh'
brew 'zsh-autosuggestions'


# Tools
brew 'youtube-dl'
brew 'speedtest-cli'
brew 'wifi-password'
brew 'htop'


# Apps
cask 'alfred'
cask 'firefox'
cask 'github-desktop'
cask 'microsoft-teams'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'
cask 'spotify'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


